
&НаКлиенте
Процедура Проверить(Команда)
	Если ПроверитьЗаполнение() Тогда
		ПроверитьНаСервере();
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Процедура ПроверитьНаСервере()
	ТекстЗапроса = "[ """+ИсходноеЗначение+""" ]";
	
	ХТТПЗапрос = Новый HTTPЗапрос();
	ХТТПЗапрос.АдресРесурса = "/api/v2/clean/address";
	ХТТПЗапрос.Заголовки.Вставить("Content-Type", "application/json");
	ХТТПЗапрос.Заголовки.Вставить("Authorization", "Token " + АпиКлюч);
	ХТТПЗапрос.Заголовки.Вставить("X-Secret", СекретныйКлюч);
	
	ХТТПЗапрос.УстановитьТелоИзСтроки(ТекстЗапроса, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
	Соединение = Новый HTTPСоединение("dadata.ru",,,,Новый ИнтернетПрокси,, Новый ЗащищенноеСоединениеOpenSSL);
	ОтветHTTP = Соединение.ОтправитьДляОбработки(ХТТПЗапрос);
	Ответ = ОтветHTTP.ПолучитьТелоКакСтроку();	
КонецПроцедуры
